app/controllers/candidatos_controller.rb

	def set_lista_disciplinas
      @lista_disciplinas = ListaDisciplina.all
---
SELECT "lista_disciplinas".* FROM "lista_disciplinas"

	def index
		@candidatos = Candidato.all
---
SELECT "candidatos".* FROM "candidatos"

	def show
		id = params[:id]
		@candidato = Candidato.find(id)
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		permitted = params.require(:candidato).permit(:nome,:matricula,:disciplina,:monitoria,:semestre,:id_of_user)
		@candidato = Candidato.create!(permitted)
---
INSERT INTO "candidatos" ("nome", "matricula", "disciplina", "monitoria", "semestre", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "adsas"], ["matricula", "asdasda"], ["disciplina", "Teste"], ["monitoria", "Voluntaria"], ["semestre", 1], ["created_at", 2016-12-15 14:43:01 UTC], ["updated_at", 2016-12-15 14:43:01 UTC]]

	def edit
		@candidato = Candidato.find params[:id]
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		permitted = params.require(:candidato).permit(:nome,:matricula,:disciplina,:monitoria,:semestre,:prioridade)
		@candidato = Candidato.find params[:id]
		@candidato.update_attributes!(permitted)
---
SELECT  "candidatos".* FROM "candidatos" WHERE "candidatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "candidatos" SET "matricula" = ?, "prioridade" = ?, "updated_at" = ? WHERE "candidatos"."id" = ?  [["matricula", "11/111111111 Teste Alterar"], ["prioridade", 4], ["updated_at", 2016-12-15 07:33:54 UTC], ["id", 1]]