app/controllers/disciplinas_controller.rb

SELECT "disciplinas".* FROM "disciplinas"
---
  def index
    @disciplinas = Disciplina.all

SELECT "professors".* FROM "professors"
SELECT "oferta".* FROM "oferta"
---
  def new
    @professores = Professor.all
    @ofertadas = Oferta.all #todas as disciplinas ofertadas no semestre

SELECT  1 AS one FROM "disciplinas" WHERE "disciplinas"."nome" = ? AND "disciplinas"."professor" = ? LIMIT ?  [["nome", "NOCOES DE SISTEMAS OPERACIONAIS"], ["professor", "EDISON ISHIKAWA"], ["LIMIT", 1]]
INSERT INTO "disciplinas" ("nome", "professor", "vagas", "created_at", "updated_at", "ativa") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "disc2"], ["professor", "teste"], ["vagas", #<BigDecimal:7f1d88064ee0,'0.0',9(9)>], ["created_at", 2017-07-04 06:37:12 UTC], ["updated_at", 2017-07-04 06:37:12 UTC], ["ativa", true]]
---
  def create
    params.permit!
    @disciplina = params.require(:disciplina).permit(:nome, :professor, :vagas)
    arr = params.require(:disciplina).permit(:nome, :professor).values

    if Disciplina.exists?(:nome => arr[0], :professor => arr[1])
      flash[:aviso] = "A oferta não foi incluída pois já existe"
    else
      if Disciplina.create!(@disciplina)

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "professors".* FROM "professors"
---
    def edit
    @id = params[:id]
    @disciplina = Disciplina.find(@id)
    @professores = Professor.all

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "disciplinas"."id" FROM "disciplinas" WHERE "disciplinas"."nome" = ? AND "disciplinas"."professor" = ?  [["nome", "Disciplina 1"], ["professor", "Professor 1"]]
UPDATE "disciplinas" SET "vagas" = ?, "updated_at" = ? WHERE "disciplinas"."id" = ?  [["vagas", #<BigDecimal:7f73120e2e28,'0.2E1',9(18)>], ["updated_at", 2016-12-15 01:11:05 UTC], ["id", 1]]
---
  def update
    params.permit!
    @id = params[:id]
    @disciplina = Disciplina.find(@id)
    @prof = params.require(:disciplina).permit(:professor).values
    @check = Disciplina.where( :nome => @disciplina.nome, :professor => @prof[0]).ids

    if  @check.empty? or (@check.include? @disciplina.id) #Verifica se eh a mesma disciplina que ja existe
      if @disciplina.update_attributes!(params[:disciplina])

DELETE FROM "disciplinas" WHERE "disciplinas"."id" = ?  [["id", 3]]
SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    @id = params[:id]
    @disciplina = Disciplina.find(@id).destroy

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @id = params[:id]
    @disciplina = Disciplina.find(@id)