app/controllers/lista_disciplinas_controller.rb

SELECT "lista_disciplinas".* FROM "lista_disciplinas"
---
  def index
    @lista_disciplinas = ListaDisciplina.all

INSERT INTO "lista_disciplinas" ("nome", "codigo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "123"], ["codigo", "teste"], ["created_at", 2016-12-15 05:34:51 UTC], ["updated_at", 2016-12-15 05:34:51 UTC]]
---
  def create
    @lista_disciplinas = ListaDisciplina.create!(params.require(:lista_disciplinas).permit(:nome, :codigo))