app/controllers/professores_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors"

  def create
  	print params[:nome]
  	@professor = params.require(:professor).permit(:nome, :email, :sala)
  	@parray = params.require(:professor).permit(:nome, :email).values

  	if Professor.exists?(:nome => @parray[0], :email => @parray[1])
  		flash[:aviso] = "O professor #{@parray[0]} não foi incluído pois já existe."
  	else
  		@professorCadastrado = Professor.create!(@professor)
---
SELECT  1 AS one FROM "professors" WHERE "professors"."nome" = ? AND "professors"."email" = ? LIMIT ?  [["nome", "Teste Inserir Professor 1"], ["email", "teste1@unb.br"], ["LIMIT", 1]]
INSERT INTO "professors" ("nome", "email", "sala", "created_at", "updated_at", "id_of_user") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "teste"], ["email", "professor@test.com"], ["sala", "test'1"], ["created_at", 2017-07-04 06:10:32 UTC], ["updated_at", 2017-07-04 06:10:32 UTC], ["id_of_user", "2"]]

  def edit
  	@id = params[:id]
  	@professor = Professor.find(@id)
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	params.permit!
  	@id = params[:id]
  	@professor = Professor.find(@id)
  	@parray = params.require(:professor).permit(:nome, :email).values

  	if Professor.exists?(:nome => @parray[0], :email => @parray[1])
  		flash[:aviso] = "O professor #{@parray[0]} não foi modificado pois já existe."
  	else
  		if @professor.update_attributes!(params[:professor])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "professors" SET "nome" = ?, "email" = ?, "sala" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["nome", "ALEXANDRE ZAGHETTO e ANDRÉ COSTA DRUMMOND"], ["email", ""], ["sala", ""], ["updated_at", 2016-12-15 07:20:31 UTC], ["id", 5]]

  def destroy
    @id = params[:id]
  	@professor = Professor.find(@id).destroy
---
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 3]]
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def show
    @id = params[:id]
  	@professor = Professor.find(@id)
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]